#include "player_property.h"

char* catalog[2000][6];

char* search_card(int situation,int number)                     //查询编号代表的手卡效果
{

	switch(situation)
	{
		case p_name:
			if(catalog[number][0]!=NULL)return catalog[number][0];
			break;
		case p_details:
			if(catalog[number][1]!=NULL)return catalog[number][1];
			break;
	}
	cout<<"出错！number="<<number<<endl;

	return "莫名其妙号卡";
}



void ini_catalog()//初始化卡片目录
{
	

	//catalog[11][0]="11号卡";catalog[11][1]=
//---------------------------------------------------助攻卡---------------------------------------------------
	catalog[30][0]="决义·地割";
	catalog[30][1]="使对手-1血(对手可丢1卡躲避此伤血),若命中,则对手在此次普攻结束前不能行动\n";
	catalog[31][0]="劈夺斩";
	catalog[31][1]="此次普攻自己攻+1,自己查看 被攻者 所有手卡,并选1张加入自己手卡,若选中装备卡则直接给自己装备上\n";
	catalog[32][0]="剑飞·回斩";
	catalog[32][1]="此次普攻自己装备的所有武器无效化,普攻结束后武器重新有效化且对手受到自己当前武器数量×2的伤血\n";
	catalog[33][0]="霸地·挥刃";
	catalog[33][1]="【自己装备武器】自己抽1卡,使对手-1血（对手可丢1卡躲避此伤血）\n";
	catalog[34][0]="极寒加护";
	catalog[34][1]="此次普攻自己攻+1,普攻成功后30%使对手接下来的此回合和下回合不能行动\n";
	catalog[35][0]="雷霆加护";
	catalog[35][1]="此次普攻自己攻+2,普攻成功后50%使对手随机丢1卡\n";
	catalog[36][0]="炽焰加护";
	catalog[36][1]="此次普攻自己攻+1,普攻成功后40%使对手-1血\n";
	catalog[37][0]="流水加护";
	catalog[37][1]="此次普攻自己攻+1,普攻成功后使被对手随机丢2卡，抽2卡\n";
	catalog[38][0]="神光加护";
	catalog[38][1]="此次普攻自己攻+1,普攻成功后自己抽1卡\n";
	catalog[39][0]="冥幽加护";
	catalog[39][1]="此次普攻自己攻+2,普攻成功后30%使被普攻者装备的武器全部破坏\n";
	catalog[40][0]="神·空·斩";
	catalog[40][1]="此次普攻无法被躲避、格挡，自己总攻击力减半且变为穿攻\n";
//---------------------------------------------------助攻卡---------------------------------------------------
//---------------------------------------------------效果卡---------------------------------------------------
	catalog[60][0]="神起·焰射";
	catalog[60][1]="【自己普攻失败时】自己丢光手卡，使所有对手-1血且装备卡全被破坏\n";
	catalog[61][0]="近击·搏杀";
	catalog[61][1]="【自己参与的1次事件连锁超过4次】使 与自己搏斗者 伤3血(此为超速普攻),此回合被强制结束\n";
	catalog[62][0]="阴势·突进";
	catalog[62][1]="【自己回合自己未处于搏斗】自己指定1个对手-1血且此回合不能行动(对手可丢1卡躲避此效果),之后的此回合自己只能对被指定者进行普攻\n";
	catalog[63][0]="神空·闪降";
	catalog[63][1]="【自己回合自己未处于搏斗】自己抽1卡,将抽到的该卡公开,自己这回合的规则性普攻次数被重置为1\n";
	catalog[64][0]="空遁·闪回";
	catalog[64][1]="【自己即将受到普攻】自己抽1卡且躲避此次搏斗,自己可普攻其1次\n";
	catalog[65][0]="光斩·绝杀";
	catalog[65][1]="【自己即将受到致命伤血】此次伤血无效化且此回合自己攻击力×2，自己可对其进行1次普攻\n";
	catalog[66][0]="天华绝伦";
	catalog[66][1]="【此回合内自己成功普攻超过2次且自己普攻成功时】自己超速普攻 被攻者 4次，每次超速普攻对其造成的普攻伤血强制变为1且不会造成反伤\n";
	catalog[67][0]="神尚激光";
	catalog[67][1]="【己方回合自己未处于搏斗】自己丢光手卡,此回合之后的3轮回内自己若受到致命伤血，使自己受到致命伤血者 将受到之前自己丢光手卡数值×2的伤血\n";
	catalog[68][0]="轰炸星球";
	catalog[68][1]="【自己回合自己未处于搏斗】破坏场上所有场景卡和结界卡,每破坏1张,使 放置该结界或场景者 -2血\n";
	catalog[69][0]="最后的指望";
	catalog[69][1]="【自己濒死时】自己指定1人,将自己全部手卡、装备的武器全部加入他手卡\n";
	catalog[70][0]="双臂剑";
	catalog[70][1]="【自己回合自己未处于搏斗】自己血-3,将卡堆最上方的2张武器卡装备上\n";
	catalog[71][0]="离心续";
	catalog[71][1]="【自己普攻成功时】自己再对其进行1次普攻,此次普攻造成的普攻伤血翻倍\n";
	catalog[72][0]="混虚·太清";
	catalog[72][1]="【自己即将受到普攻时】自己丢光手卡、躲避本次普攻,使对己普攻者 血量减半\n";
	catalog[73][0]="幻影剑";
	catalog[73][1]="【自己武器栏没满】此卡当作 攻+2 的武器给自己装备,此武器在此回合结束时自动被破坏\n";
	catalog[74][0]="冷现·巨剑";
	catalog[74][1]="【自己受到效果伤血时】自己丢1手卡中的武器卡,指定1人-2血\n";
	catalog[75][0]="隐天盾";
	catalog[75][1]="此卡发动的回合及发动后2轮回内,自己可丢1卡 无效化1次对己的非自主效果伤血 或 格挡1次普攻\n";
	catalog[76][0]="破局·神击";
	catalog[76][1]="【自己普攻失败时】自己可丢任意数量的手卡,使 被攻者 受到丢卡数量的伤血.自己普攻 使自己普攻失败者 1次,且此次普攻内 被攻者 无法行动\n";
	catalog[77][0]="旋地·回击";
	catalog[77][1]="【自己受到普攻时】自己抽1卡,自己可普攻 发动普攻者 1次,本次攻击自己攻+1\n";

	//---------------------------------------------------效果卡---------------------------------------------------
	//---------------------------------------------------隐效果---------------------------------------------------
	
	catalog[400][0]="连攻";
	catalog[400][1]="【自己回合自己未处于搏斗】自己发动一次普攻\n";

	catalog[401][0]="闪";
	catalog[401][1]="【自己被普攻时】躲避那次普攻\n";

	catalog[402][0]="+4血";
	catalog[402][1]="指定1人回复4血\n";

	catalog[403][0]="暗枪";
	catalog[403][1]="【自己参与搏斗时】使 与自己搏斗者 伤1血\n";

	catalog[404][0]="稻草人";
	catalog[404][1]="【自己被普攻时】躲避那次普攻，普攻者 武器全被破坏\n";

	catalog[405][0]="憎恨";
	catalog[405][1]="(1)指定1人的人物效果此回合无法发动\n";
	catalog[405][2]="(2)破坏场上一张 装备卡 或 场景卡 或 结界卡\n";
	catalog[405][3]="(3)非人物卡 发动无效并破坏\n";
	catalog[405][4]="(4)指定1人，消除其身上所有buff\n";

	catalog[406][0]="极天束";
	catalog[406][1]="【自己普攻成功时】使 被普攻者 伤2血\n";

	catalog[407][0]="蓝爆冰晶";
	catalog[407][1]="【己方回合自己未处于搏斗】指定1人3次50%伤1血，若全中则其装备全部被破坏\n";

	//---------------------------------------------------隐效果---------------------------------------------------
	//---------------------------------------------------武器卡---------------------------------------------------

	catalog[0][0]="承皇剑";
	catalog[0][1]="攻+1\n";
	catalog[0][2]="(1)1回合限1次，自己可丢1手卡，抽1卡\n";
	catalog[0][3]="(2)自己可挡4次普攻，抵挡第4次普攻后此卡被破坏\n";
	catalog[0][4]="(3)【自己回合可发动】自己主动将此卡破坏，指定1人-1血\n";
 
	catalog[1][0]="疾风刃";
	catalog[1][1]="攻+1\n";
	catalog[1][2]="(1)1回合限2次，自己可丢1手卡，自己此回合攻+1\n";
	catalog[1][3]="(2)【自己回合可发动】自己主动将此卡破坏，指定1人-1血\n";

	catalog[2][0]="长者之镰";
	catalog[2][1]="攻+2\n";
	catalog[2][2]="(1)自己每使1人伤1血，自己+1血\n";
	catalog[2][3]="(2)【自己回合可发动】自己主动将此卡破坏，指定1人+3血\n";

	catalog[3][0]="噬剑之剑";
	catalog[3][1]="攻+1\n";
	catalog[3][2]="(1)自己每次与人搏斗过后限1次，随机破坏 与自己搏斗者 装备的1张装备卡，破坏后这把武器攻+1\n";
	catalog[3][3]="(2)【自己回合可发动】自己主动将此卡破坏，指定1人-1血\n";

	catalog[4][0]="黑曜剑";
	catalog[4][1]="攻+2\n";
	catalog[4][2]="(1)此卡被装备上时自己-3血\n";
	catalog[4][3]="(2)此次游戏限1次可发动，发动回合过后，自己持续不死2轮回\n";
	catalog[4][4]="(3)【自己回合可发动】自己主动将此卡破坏，指定1人50%-2血\n";

	catalog[5][0]="食腐再生装置";
	catalog[5][1]="(1)自己每抽1卡，自己血+1\n";
	catalog[5][2]="(2)1回合限1次，自己可丢1手卡，血+1\n";
	catalog[5][3]="(3)自己回合限1次，自己可额外抽1卡\n";

	catalog[6][0]="恩空法棒";
	catalog[6][1]="(1)此武器初始有2魔力指示物\n";
	catalog[6][2]="(2)己方每发动1手卡，此武器魔力指示物+1\n";
	catalog[6][3]="(3)【自己回合可发动】自己消耗2魔力指示物使1人-1血\n";

	catalog[7][0]="骷髅诡面";
	catalog[7][1]="(1)自己不受任何丢卡和手卡公开的效果影响\n";
	catalog[7][2]="(2)【场上除己外1人死亡时】自己血量回满\n";
	catalog[7][3]="(3)自己不受任何自主伤血效果影响\n";

	catalog[8][0]="破败披风";
	catalog[8][1]="(1)自己不受“无法行动”效果影响\n";
	catalog[8][2]="(2)【自己受到普攻时可发动】自己主动将此卡破坏，自己抵挡此次普攻\n";
	//catalog[8][3]="(3)自己不受装备卡被破坏效果影响\n";

	catalog[9][0]="冠阳剜月斧";
	catalog[9][1]="攻+2\n";
	catalog[9][2]="(1)【自己每次主动普攻时】所有人丢3卡，抽3卡，卡堆最上方3张卡送入废卡区\n";
	catalog[9][3]="(2)【自己回合可发动】自己主动将此卡破坏，场上所有人随机丢5卡，抽5卡\n";

	catalog[10][0]="幻影剑";
	catalog[10][1]="攻+2\n";
	//---------------------------------------------------武器卡---------------------------------------------------
}